tbirz/Tank-Control-System/ESP8266WebServerForWaterTankV2.4.cpp
#include <Arduino.h>
#include <Hash.h>
#include <ESP8266WiFi.h>
#include <WebSocketsServer.h>
WebSocketsServer webSocket = WebSocketsServer(81);
#include <ESP8266WebServer.h>
ESP8266WebServer server(80);

int connCount = 0;
int serialSwapped = 0;
int wsConnected = 0;
int wsDisconnected = 0;
String wsPayload = "";
String rxTempString = "";

String rxSystemAlarm = "";
String rxOperatingMode = "";
String rxAvailableCapacity = "";
String rxPercentageLevel = "";
String rxActualLevel = "";
String rxTemperatureLevel = "";
String rxTankHeight = "";
String rxRefillSetPoint = "";
String rxFullSetPoint = "";
String rxTotalCapacity = "";
String rxController12v = "";
String rxController7v = "";
String rxController5v = "";
String rxController3v3 = "";
String rxControllerVacConst = "";
String rxControllerVacSw = "";
String rxBatteryVoltageLevel = "";
String rxSensorControl5v = "";
String rxServo1Position = "";
String rxServo2Position = "";
String rxRelay1Position = "";
String rxRelay2Position = "";
String rxTankEmpty = "";
String rxTankFull = "";
String rxTankLevelOk = "";
String rxPumpRunning = "";
String rxRadioLinkRunning = "";
String rxServosRunning = "";
String rxVacActive = "";
String rxTankFilling = "";
String rxBuzzerActive = "";

long baud = 9600;
String tmpString = "";
unsigned int count = 0;
const byte maxBuffer = 64;
static char buffer[maxBuffer];
char webData[maxBuffer];
byte idxData = 0;

/*

//Static IP address configuration for hotspot
IPAddress ip(192, 168, 43, 253); //ESP static ip
IPAddress gateway(192, 168, 43, 1);   //IP Address of your WiFi Router (Gateway)
IPAddress subnet(255, 255, 255, 0);  //Subnet mask
IPAddress dns(8, 8, 8, 8);  //DNS


//Enter your Wi-Fi SSID and PASSWORD
const char* ssid     = "YellowAndBlack";
const char* password = "tigers2017";
const char* deviceName = "ESP8266";

*/
  //Static IP address configuration for home
  IPAddress ip(192, 168, 99, 253); //ESP static ip
  IPAddress gateway(192, 168, 99, 1);   //IP Address of your WiFi Router (Gateway)
  IPAddress subnet(255, 255, 255, 0);  //Subnet mask
  IPAddress dns(8, 8, 8, 8);  //DNS

  //Enter your Wi-Fi SSID and PASSWORD
  const char* ssid     = "Tigerland2.4";
  const char* password = "1980premiers";
  const char* deviceName = "ESP8266";

// This function returns an HTML formated page in the correct type for display
// It uses the Raw string macro 'R' to place commands in PROGMEM
const char Web_page[] PROGMEM = R"=====(
<!DOCTYPE html>
<html>
<html lang="en">

<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.4.1/css/bootstrap.min.css">
  <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.4.1/jquery.min.js"></script>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.16.0/umd/popper.min.js"></script>
  <script src="https://maxcdn.bootstrapcdn.com/bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script>
$(document).ready(function(){
  
     $("#popoverOpMode").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverOpModes(),
    });

     $("#popoverTankFull").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

    $("#popoverTankLevelOk").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

    $("#popoverTankEmpty").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });
    
    $("#popoverTankFilling").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });
    
    $("#popoverPumpRunning").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

    $("#popoverServosRunning").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

     $("#popoverServo1Position").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverSwitching(),
    });

    $("#popoverServo2Position").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverSwitching(),
    });

    $("#popoverRadioLinkActive").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

    $("#popoverVacConstActive").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

    $("#popoverRelay1Position").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverSwitching(),
    });

    $("#popoverRelay2Position").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverSwitching(),
    });
    
    $("#popoverBuzzerActive").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    }); 

    $("#popoverSystemAlarm").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverAlarm(),
    });
});

</script>
<style>

    #heading {
          color: lime;
          font-size: 75%;
          font-weight: bold;
          margin-bottom: 0px;
        }    
    .table th {
          text-align: center;
          font-size: 85%;
        }    
    .table td {
          text-align: center;
          font-size: 70%;
        }
    #popoverRef td {
      display:hidden;
     align-items:left;
     text-align: left;
     font-size: 70%;     
    }
    #circleOpMode {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleOpMode0 {
      background: lime;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleOpMode1 {
      background: green;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleOpMode2 {
      background: yellow;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
     }
       #circleOpMode3 {
      background: orange;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleOpMode4 {
      background: grey;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
      #circleOFF {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleON {
      background: lime;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
      #circleUNSW {
      background: lime;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleSW {
      background: blue;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleALARM {
      background: orange;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    } 
    #circleERROR {
      background: red;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleOTHER {
      background: black;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleTankFull {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleTankLevelOk {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleTankEmpty {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleTankFilling {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circlePumpRunning {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleServosRunning {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleServo1Position {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleServo2Position {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleRadioLinkActive {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleVacActive {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleRelay1Position {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleRelay2Position {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleBuzzerActive {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleSystemAlarm {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
  
