tbirz/Tank-Control-System/ESP8266WebServerForWaterTankV2.4.cpp
    var Socket;
    var maxBuffer=64;

function popoverOpModes(){ 
  return ('<p><span id="circleOpMode0"></span> TDPSM - Tank Disconnected, Pump Stopped in Auto Mode (Default)<br>' + 
   '<span id="circleOpMode1"></span> TCPRA - Tank Connected, Pump Running in Auto Mode<br>' +
   '<span id="circleOpMode2"></span> TDPSM - Tank Disconnected, Pump Stopped in Manual Mode<br>' +
   '<span id="circleOpMode3"></span> TCPRM - Tank Connected, Pump Running in Manual Mode<br>' +
   '<span id="circleOpMode4"></span> TDPSB - Tank Disconnected, Pump Stopped in Bypass Mode<br>' +
   '<span id="circleERROR"></span> ERROR<br>' + 
   '<span id="circleOTHER"></span> OTHER</p>');
 }

 function popoverONOFF() {
  return ('<p><span id="circleOFF"></span> OFF<br>' + 
   '<span id="circleON"></span> ON<br>' +
   '<span id="circleERROR"></span> ERROR<br>' + 
   '<span id="circleOTHER"></span> OTHER</p>'); 
 }

  function popoverSwitching() {
  return ('<p><span id="circleUNSW"></span> Default Position<br>' + 
   '<span id="circleSW"></span> Switched Position<br>' +
   '<span id="circleERROR"></span> ERROR<br>' + 
   '<span id="circleOTHER"></span> OTHER</p>');  
 }
function popoverAlarm() {
  return ('<p><span id="circleOFF"></span> OFF<br>' + 
   '<span id="circleALARM"></span> ALARM<br>' +
   '<span id="circleERROR"></span> ERROR<br>' + 
   '<span id="circleOTHER"></span> OTHER</p>');  
 }

  function wsReadyState(){
   if (Socket.readyState == 0) {
    document.getElementById("ws-Status").innerHTML="WS CONNECTING....";
   }
   else if(Socket.readyState == 1) {
    document.getElementById("ws-Status").innerHTML="WS OPEN";
   }
   else if(Socket.readyState == 2) {
    document.getElementById("ws-Status").innerHTML="WS CLOSING....";
   }
    else if(Socket.readyState == 3) {
    document.getElementById("ws-Status").innerHTML="WS CLOSED";
   }
   else {
    document.getElementById("ws-Status").innerHTML="NOT RUNNING";
   }
   setTxItemStatus();
}


function setTxItemStatus() {
  if (Socket.readyState !=1) {
 document.getElementById("txBuff").disabled=true; 
 document.getElementById("txButt").disabled=true; 
  }
  else {
 document.getElementById("txBuff").disabled=false; 
 document.getElementById("txButt").disabled=false;     
  }
}
   
 function initWebSockets() {
    Socket = new WebSocket('ws://' + window.location.hostname + ':81/'); 
    Socket.onopen = function(e) {
    Socket.send('Socket Connected @: ' + new Date());  
      wsReadyState();    
    }
}

function socketClose() {
    Socket.onclose = function(e) {
     Socket.send('Socket Closed @: ' + new Date());   
     wsReadyState(); 
    console.log('Socket Closed: ' + e.code + e.reason)
    }
}

function socketReceive() { 
    var rxBuffer;
    Socket.bufferType = "string"; 
    Socket.onmessage = function(e) { // Log messages from the server     
        document.getElementById("rxConsole").value+=e.data;
        rxBuffer=document.getElementById("rxConsole").value;
        rxBuffer=""; 
        for (var rxIdx=0; rxIdx < maxBuffer; rxIdx++) {
          rxBuffer += e.data;                                 
        }
        console.log('Data: ' + rxBuffer)
        processData(rxBuffer, maxBuffer);
        statusCondition();
        document.getElementById("rxConsole").value=""; 
  } 
}

function processData(rxData,maxBuffer) {
  var filterDiscard = /^[A-Za-z,\s]+$/;  //\s=whitespace
  var rxStringValue="";
  var valueLengthMax=10;
  for (var idx = 0; idx < maxBuffer; idx++) {
    //-----------------------------------------------------
    //Reported data levels
    //-----------------------------------------------------
    if (rxData[idx] == 'A') { //Available Capacity
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("AvailableCapacity").innerHTML = rxStringValue;
      rxStringValue="";
   } 
    //-----------------------------------------------------    
    if (rxData[idx] == 'B') { //BatteryVoltageLevel
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("BatteryVoltageLevel").innerHTML = rxStringValue;
      rxStringValue="";
    }
    //-----------------------------------------------------     
    if (rxData[idx] == 'C') { //TotalCapacity
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("TotalCapacity").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------   
    if (rxData[idx] == 'D') { //ActualLevel
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("ActualLevel").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------  
    if (rxData[idx] == 'F') { //FullSetPoint
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("FullSetPoint").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------
   if (rxData[idx] == 'H') { //TankHeight
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("TankHeight").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------
    if (rxData[idx] == 'I') { //Controller12v
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("Controller12v").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------
    if (rxData[idx] == 'J') { //Controller7v
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("Controller7v").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
    if (rxData[idx] == 'K') { //Controller5v
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("Controller5v").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------
    if (rxData[idx] == 'L') { //Controller3v3
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("Controller3v3").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
    if (rxData[idx] == 'M') { //controllerVacConst
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("controllerVacConst").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
    if (rxData[idx] == 'N') { //controllerVacSw
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("controllerVacSw").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------   
    if (rxData[idx] == 'P') { //PercentageLevel
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("PercentageLevel").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------
     if (rxData[idx] == 'R') { //RefillSetPoint
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("RefillSetPoint").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
    if (rxData[idx] == 'T') { //TemperatureLevel
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("TemperatureLevel").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------
     if (rxData[idx] == 'V') { //SensorControl5v
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("SensorControl5v").innerHTML = rxStringValue;
      rxStringValue="";
    }     
    //-----------------------------------------------------
    //Controller indications
    //-----------------------------------------------------    
         if (rxData[idx] == 'a') { //AlarmStatus
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("SystemAlarm").innerHTML = rxStringValue;
      rxStringValue="";
    }  
  //-----------------------------------------------------            
     if (rxData[idx] == 'b') { //BuzzerActive
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("BuzzerActive").innerHTML = rxStringValue;
      rxStringValue="";
    }  
    //-----------------------------------------------------  
    if (rxData[idx] == 'e') { //TankEmpty
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("TankEmpty").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
    if (rxData[idx] == 'f') { //TankFull
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("TankFull").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
     if (rxData[idx] == 'l') { //TankLevelOk
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("TankLevelOk").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
    if (rxData[idx] == 'o') { //OperatingMode
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("OperatingMode").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------  
    if (rxData[idx] == 'p') { //PumpRunning
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("PumpRunning").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
    if (rxData[idx] == 'r') { //RadioLinkActive
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("RadioLinkActive").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
    if (rxData[idx] == 's') { //ServosRunning
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("ServosRunning").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------
    if (rxData[idx] == 't') { //TankFilling
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("TankFilling").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
    if (rxData[idx] == 'v') { //VacActive
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("VacConstActive").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //----------------------------------------------------- 
    if (rxData[idx] == 'w') { //Relay1Position
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("Relay1Position").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------
    if (rxData[idx] == 'x') { //Relay2Position
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("Relay2Position").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------
    if (rxData[idx] == 'y') { //Servo1Position
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("Servo1Position").innerHTML = rxStringValue;
      rxStringValue="";
    } 
    //-----------------------------------------------------
    if (rxData[idx] == 'z') { //Servo2Position
      for (var idxSub = 1; idxSub < valueLengthMax ; idxSub++) {
        if (rxData[idx + idxSub].match(filterDiscard)) {
          rxData[idx] = rxData[idx + idxSub];
          break;
        }
        else {
          rxStringValue += rxData[idx + idxSub];              
        }      
      }
      document.getElementById("Servo2Position").innerHTML = rxStringValue;
      rxStringValue="";
    }             
  }
}

