tbirz/Tank-Control-System/ESP8266WebServerForWaterTankV2.4.cpp
function socketErrors() {// Log errors
  Socket.onerror = function (e) {
    console.log('WebSocket Error: ' + e.message);
  } 
}
    
function enterPressed() {//function for when 'send' button pressed
   if(Socket.readyState==1) {
      document.getElementById("txButt").style.color="red"; 
      Socket.send(document.getElementById("txBuff").value); //Send the data from txBuff input to server, to use this function just input the string you want to send.
       //alert("Submitted code: " && document.getElementById("txBuff").value && " has been transmitted");
      document.getElementById("txBuff").value = ""; //clears the texbox after data is sent
   }
   else if(Socket.readyState==1 && document.getElementById("txBuff").value == "") {
         alert("To submit you must add text!.");
         return;
   }
}
   
function addLoadEvent(func) {
   var oldonload = window.onload;
   if (typeof window.onload != 'function') {
       window.onload = func;
   } 
   else {
          window.onload = function() {
          if (oldonload) {
              oldonload();
          }
          func();
          }   
  }
}
addLoadEvent(initWebSockets);
addLoadEvent(statusCondition);

setInterval(function () { updateDTG(); }, 1000); //used for showing current DTG

function updateDTG() {
  var d = new Date();
  var t = "";
  t = d.toLocaleString('en-AU', { hour12: false });
  document.getElementById('DTG').innerHTML = t;
}

function statusCondition() {
  checkPercentageLevel();
  checkTemperatureLevel();
  checkControllerDCVoltageLevels();
  checkControllerACVoltageLevels();
  checkRemoteSensorDCVoltageLevels();
  checkControllerIndicators();
  checkFixedInfo();
}
//----------------------------------------------------------------------------
// Status Color for table rows & indicators
//----------------------------------------------------------------------------
 //Static Table Info
function checkFixedInfo() {     
  var tblFixedInfo = document.getElementById('fixedInfo');
  var rowValue;
  for(i=1; i<tblFixedInfo.rows.length; i++){
    rowValue=tblFixedInfo.rows[i].cells[tblFixedInfo.rows[i].cells.length-2].innerText;
    rowValue=parseFloat(rowValue);
    //console.log(rowValue);
    if(isNaN(rowValue)) {
      bgColor='red';
      tblFixedInfo.rows[i].style.backgroundColor = bgColor;
      tblFixedInfo.rows[i].style.color = 'white';
    }
    else if(rowValue >0) {
      bgColor='yellowgreen';
      tblFixedInfo.rows[i].style.backgroundColor = bgColor;
      tblFixedInfo.rows[i].style.color = 'initial';
    }
    else if(rowValue <=0) {
      bgColor='red';
      tblFixedInfo.rows[i].style.backgroundColor = bgColor;
      tblFixedInfo.rows[i].style.color = 'white';
    }
    else {
      bgColor='transparent';
      tblFixedInfo.rows[i].style.backgroundColor = bgColor;
      tblFixedInfo.rows[i].style.color = 'initial';
    }              
  }                   
} 
//----------------------------------------------------------------------------
  //Control Status Indicators
   function checkControllerIndicators() {
    //OperatingMode
      var opMode = document.getElementById("OperatingMode").innerHTML;
      if (opMode == '0') { //TDPSA
        document.getElementById("circleOpMode").style.backgroundColor = 'lime';
      }
      else if (opMode == '1') { //TCPRA
        document.getElementById("circleOpMode").style.backgroundColor = 'green';
      }
      else if (opMode == '2') { //TDPSM
        document.getElementById("circleOpMode").style.backgroundColor = 'yellow';
      }
      else if (opMode == '3') { //TCPRM
        document.getElementById("circleOpMode").style.backgroundColor = 'orange';
      }
      else if (opMode == '4') { //TDPSB
        document.getElementById("circleOpMode").style.backgroundColor = 'grey';
      }
      else if (isNaN(opMode)) {
        document.getElementById("circleOpMode").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleOpMode").style.backgroundColor = 'black';
      }

      //TankFull
      var tankFull = document.getElementById("TankFull").innerHTML;
      if (tankFull == '1') {
        document.getElementById("circleTankFull").style.backgroundColor = 'lime';
      }
      else if (tankFull == '0') {
        document.getElementById("circleTankFull").style.backgroundColor = 'transparent';
      }
       else if (isNaN(tankFull)) {
        document.getElementById("circleTankFull").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleTankFull").style.backgroundColor = 'black';
      }

      //TankLevelOk
      var tankLevelOk = document.getElementById("TankLevelOk").innerHTML;
      if (tankLevelOk == '1') {
        document.getElementById("circleTankLevelOk").style.backgroundColor = 'lime';
      }
      else if (tankLevelOk == '0') {
        document.getElementById("circleTankLevelOk").style.backgroundColor = 'transparent';
      }
      else if (isNaN(tankLevelOk)) {
        document.getElementById("circleTankLevelOk").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleTankLevelOk").style.backgroundColor = 'black';
      }

      //TankEmpty
      var tankEmpty = document.getElementById("TankEmpty").innerHTML;
      if (tankEmpty == '1') {
        document.getElementById("circleTankEmpty").style.backgroundColor = 'lime';
      }
      else if (tankEmpty == '0') {
        document.getElementById("circleTankEmpty").style.backgroundColor = 'transparent';
      }
      else if (isNaN(tankEmpty)) {
        document.getElementById("circleTankEmpty").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleTankEmpty").style.backgroundColor = 'black';
      }

      //TankFilling
      var tankFilling = document.getElementById("TankFilling").innerHTML;
      if (tankFilling == '1') {
        document.getElementById("circleTankFilling").style.backgroundColor = 'lime';
      }
      else if (tankFilling == '0') {
        document.getElementById("circleTankFilling").style.backgroundColor = 'transparent';
      }
       else if (isNaN(tankFilling)) {
        document.getElementById("circleTankFilling").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleTankFilling").style.backgroundColor = 'black';
      }

      //PumpRunning
      var pumpRunning = document.getElementById("PumpRunning").innerHTML;
      if (pumpRunning == '1') {
        document.getElementById("circlePumpRunning").style.backgroundColor = 'lime';
      }
      else if (pumpRunning == '0') {
        document.getElementById("circlePumpRunning").style.backgroundColor = 'transparent';
      }
       else if (isNaN(pumpRunning)) {
        document.getElementById("circlePumpRunning").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circlePumpRunning").style.backgroundColor = 'black';
      }

      //ServosRunning
      var servosRunning = document.getElementById("ServosRunning").innerHTML;
      if (servosRunning == '1') {
        document.getElementById("circleServosRunning").style.backgroundColor = 'lime';
      }
      else if (servosRunning == '0') {
        document.getElementById("circleServosRunning").style.backgroundColor = 'transparent';
      }
       else if (isNaN(servosRunning)) {
        document.getElementById("circleServosRunning").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleServosRunning").style.backgroundColor = 'black';
      }

      //Servo1Position
      var servo1Position = document.getElementById("Servo1Position").innerHTML;
      if (servo1Position == '0') { //vertical
        document.getElementById("circleServo1Position").style.backgroundColor = 'lime';
      }
      else if (servo1Position == '1') { //horizontal
        document.getElementById("circleServo1Position").style.backgroundColor = 'blue';
      }
       else if (isNaN(servo1Position)) {
        document.getElementById("circleServo1Position").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleServo1Position").style.backgroundColor = 'black';
      }

      //Servo2Position
      var servo2Position = document.getElementById("Servo2Position").innerHTML;
      if (servo2Position == '0') { //horizontal
        document.getElementById("circleServo2Position").style.backgroundColor = 'lime';
      }
      else if (servo2Position == '1') { //vertical
        document.getElementById("circleServo2Position").style.backgroundColor = 'blue';
      }
       else if (isNaN(servo2Position)) {
        document.getElementById("circleServo2Position").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleServo2Position").style.backgroundColor = 'black';
      }

      //RadioLinkRunning
      var radioLinkActive = document.getElementById("RadioLinkActive").innerHTML;
      if (radioLinkActive == '1') {
        document.getElementById("circleRadioLinkActive").style.backgroundColor = 'lime';
      }
      else if (radioLinkActive == '0') {
        document.getElementById("circleRadioLinkActive").style.backgroundColor = 'transparent';
      }
       else if (isNaN(radioLinkActive)) {
        document.getElementById("circleRadioLinkActive").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleRadioLinkActive").style.backgroundColor = 'black';
      }

