tbirz/Tank-Control-System/ESP8266WebServerForWaterTankV2.4.cpp
    while (WiFi.status() != WL_CONNECTED) { // Wait for WiFi to connect 
    if (idxCount==250) {
    Serial.println();
    Serial.println("Failed to connect to router. Resetting.....");
    ESP.restart();
    }
    if(idx==50) {
     Serial.println(); 
     idx=0;
    }
    Serial.print(".");
    delay(100);
    idx++;
    idxCount++;
    } 
    idxCount=0;
    idx=0;   
    
  Serial.println();  
  Serial.println("Connected to: "+String(ssid));
  Serial.print("Using IP address: ");
  Serial.println(WiFi.localIP());  //IP address assigned to your ESP 
//---------------------------
  server.on("/", handleRoot); // This displays the main webpage, it is called when you open a client connection on the IP address using a browser
  server.onNotFound(handleWebRequests); //Set setver all paths are not found so we can handle as per URI  
  server.begin();  // Start the webserver
  Serial.println("HTTP server started");
//--------------------------- 
  webSocket.begin();   // start the websocket server
  webSocket.onEvent(webSocketEvent);
 
 webSocket.setReconnectInterval(5000); // try ever 5000 again if connection has failed
  
  // start heartbeat (optional)
  // ping server every 10000 ms
  // expect pong from server within 3000 ms
  // consider connection disconnected if pong is not received 2 times
  webSocket.enableHeartbeat(10000, 3000, 2); 
  
  Serial.println("WebSocket server started.");
   
 } //end setup
//------------------------------------------------------------------------//
//LOOP
//------------------------------------------------------------------------//
void loop(void) {
    
    server.handleClient();  // Keep checking for a client connection
    webSocket.loop();
    processData(); // rx data from controller tx to webpage via websockets


} //end loop
